import {Component, Input, OnInit} from '@angular/core';

@Component({
  selector: 'app-embassy',
  templateUrl: './embassy.component.html',
  styleUrls: ['./embassy.component.scss']
})
export class EmbassyComponent implements OnInit {

  @Input() text: string;
  @Input() max = 779;
  seeMore = false;

  constructor() { }

  ngOnInit() {

    this.text = 'Переплетіння біографічних історій минулого, ниткою долі, сплітає історію Європи в один спільний гобелен\n' +
        '          життєвих перепитій, що переміщує нас в минуле нагадуючи про витоки, які дають творчий потенціал для\n' +
        '          продовження будівництва спільного майбутнього. А щоб ця картина стала повнішою, ми розповідатимемо історії\n' +
        '          королівських родів зв’язаних між собою сімейними вузами з монархами Руського королівства, на прикладі сімейних\n' +
        '          взаємин Великого князя(короля) Русі ХІ ст. Ярослава І Мудрого. У Польщі, Угорщині, Норвегії, Франції,\n' +
        '          Великобритаії, Данії, Швеції, монархами були родичі Ярослава , дружина, доньки, сестри, внучки доклались до\n' +
        '          правління Європейськими державами і є родичами всіх сучасних королівських родів Європи. Тож в рамках проекту\n' +
        '          Посольство Королівства Руського, планується провести візитити з культурною місією до семи держав західної\n' +
        '          Європи (Польщі, Угорщини, Норвегії, Франції, Великобританії, Данії, Швеції) для обновлення історичної пам’яті\n' +
        '          про тісне спільне минуле та укріплення досвідів історичного підгрунтя у подальших взаємодіях України з\n' +
        '          країнами західної Європи.'
  }

}
